export default {
  landing: {
    priceAndPlans: 'Плани і ціни',
    welcomeText: 'Ласкаво просимо до Gastro',
    readyTemplates: 'Готові шаблони - для будь-якого закладу',
    readyTemplatesDescription:
      'Підійдуть для кафе, ресторанів, барів чи кондитерських. Легко налаштовуються, швидко запускаються та допомагають виглядати професійно онлайн без зайвих витрат часу.',

    signUp: 'Реєстрація',
    signIn: 'Авторизація',
    notHaveAccount: 'Не має акаунта?',
    haveAccount: 'Вже маєш акаунт?',
    email: 'Емейл',
    enterEmail: 'Введіть email',
    placeName: 'Назва закладу',
    enterPlace: 'Введіть назву',
    password: 'Пароль',
    enterPassword: 'Введіть пароль',
    confirmPassword: 'Підтвердіть пароль',
    menu: 'Меню',
    name: 'Назва',
    firstMeal: 'Перша страва',
    secondMeal: 'Друга страва',
    addToCard: 'Додати до кошика',
    checkout: 'Кошик',
    buy: 'Купити',
    sum: 'Сума: ${sum}',
    numbers_1: 'користувачі, які вже спробували наш сайт',
    numbers_2: 'ключові слова',
    numbers_3: 'геобази даних',
    numbers_4: 'профілі доменів',
    openTime: 'Час відкриття',
    bookTable: 'Забронюйте столик на обід або вечерю',
    visitUs: 'Відвідайте нас',
    comeAndTaste: 'Приходьте і спробуйте нашу їжу',
    changePlan:
      'Ви впевнені, що хочете обрати цей план? Зміни відбудуться миттєво, і для відновлення попереднього плану його доведеться придбати заново',
    comeToUs:
      'Відвідайте нас та зануртеся в чарівну атмосферу, неповторні смаки й бездоганний сервіс.',
    times: [
      { day: 'Будні', time: '09.00 - 22.00' },
      {
        day: 'Субота',
        time: '09.00 - 20.00',
      },
      {
        day: 'Неділя',
        time: '10.00 - 19.00',
      },
    ],
    soups: {
      1: {
        name: 'Червоний суп',
        description:
          'Ніжний суп із стиглих томатів, приправлений запашними спеціями та краплинкою оливкової олії. Має насичений смак і яскравий колір, чудово поєднується з ароматними грінками чи свіжою зеленню.',
        ingredients: ['томати стиглі', 'часник', 'цибуля', 'базилік'],
        price: '$8.20',
      },
      2: {
        id: 2,
        name: 'Гарбузовий суп',
        description:
          'Кремовий гарбузовий суп із вершками та мускатним горіхом. Має ніжний солодкуватий смак та яскравий помаранчевий колір.',
        ingredients: ['гарбуз', 'вершки', 'мускатний горіх'],
        price: '$7.50',
      },
      3: {
        id: 3,
        name: 'Грибний суп',
        description:
          'Ароматний суп з лісових грибів, збагачений вершками та спеціями. Ідеально підходить для прохолодних вечорів.',
        ingredients: ['гриби', 'цибуля', 'вершки'],
        price: '$9.00',
      },
      4: {
        id: 4,
        name: 'Овочевий суп',
        description:
          'Легкий суп зі свіжих овочів, приправлений зеленню та оливковою олією. Добре підходить для здорового харчування.',
        ingredients: ['морква', 'броколі', 'селера'],
        price: '$6.80',
      },
    },

    infoBlock: {
      1: {
        title: 'Сайт для доставки та замовлення з собою',
        description:
          'Запустіть власну систему доставки та самовиносу для ресторану та кафе. 90% клієнтів окупають річну підписку на Gastro протягом першого тижня роботи доставки',
      },
      2: {
        title: 'Сайт для прийому онлайн-замовлень',
        description:
          'Приймайте замовлення безпосередньо з вашого сайту. Це знижує витрати на посередників та збільшує прибуток закладу.',
      },
      3: {
        title: 'Сайт для ресторанного меню',
        description:
          'Створіть інтерактивне меню з фото та описами страв. Дослідження показують, що яскраві зображення збільшують кількість замовлень на 30%.',
      },
    },
  },
  dashboard: {
    pro: {
      navs: {},
    },
    standart: {
      navs: {
        home: 'Головна',
        menu: 'Меню',
      },
    },
    tableHead: {
      name: 'Назва',
      image: 'Картинка',
      price: 'Ціна',
      category: 'Категорія',
      settings: 'Налаштування',
      deleteMeal: 'Ви впевнені, що хочете видалити дану страву?',
    },
    editText: 'Оновити дані',
    addText: 'Додати страву',
    availability: 'Наявність страви',
    available: 'В наявності',
    unavailable: 'Немає в наявності',
  },
  footer: {
    description:
      'У Gastro ми захоплені створенням незабутніх моментів завдяки нашій кулінарній майстерності.',
    copyright: 'Copyright © 2026 Gastro. All Rights Reserved.',
  },
  plans: {
    free: {
      name: 'Безплатний',
      details: [
        'Доступ до базових функцій',
        'Обмежена кількість збережень',
        'Підтримка тільки email',
      ],
    },
    standart: {
      name: 'Стандартний',
      details: ['Розширені можливості', 'Необмежені збереження', 'Пріоритетна підтримка'],
    },
    premium: {
      name: 'Преміум',
      details: ['Усі функції без обмежень', 'Інтеграція з іншими сервісами', '24/7 підтримка'],
    },
  },
  subscribe: {
    month: 'Місяць',
  },
  button: {
    add: 'Додати',
    clickMe: 'Натисни мене',
    edit: 'Оновити',
    signUp: 'Реєстрація',
    signIn: 'Вхід',
    buyNow: 'Купи зараз',
    reserveNow: 'Зарезервуй зараз',
    choose: 'Обрати',
    dashboard: 'Дашборд',
    logOut: 'Вийти',
    yes: 'Так',
    no: 'Ні',
  },
  errors: {
    email: {
      email: 'Введіть коректну адресу електронної пошти',
      emailTaken: 'Ця електронна пошта вже використовується',
      required: 'Поле обов’язкове для заповнення',
      invalidCredentials: 'Електронну пошту не знайдено',
    },
    password: {
      required: 'Поле обов’язкове для заповнення',
      minLength: 'Пароль має містити щонайменше 6 символів',
      passwordWrong: 'Неправильний пароль',
      passMissMatch: 'Паролі не збігаються',
    },
    confirmPassword: {
      required: 'Поле обов’язкове для заповнення',
      sameAs: 'Паролі повинні збігатися',
    },
    placeName: {
      required: 'Поле обов’язкове для заповнення',
      placeTaken: 'Ця назва місця вже використовується',
    },
  },
  toasts: {
    signIn: 'Ви успішно увійшли',
    error: 'Щось пішло не так, будь ласка, спробуйте пізніше',
  },
  inputs: {
    email: 'Емейл',
    placeName: 'Назва організації',
    password: 'Пароль',
    confirmPassword: 'Підтвердити пароль',
    name: 'Назва',
    description: 'Опис',
    price: 'Ціна',
  },
  navs: {
    home: 'Головна',
    info: 'Про нас',
    plans: 'Плани та ціни',
    map: 'Контакти',
  },
}
