export default {
  landing: {
    readyTemplates: 'Готові шаблони - для будь-якого закладу',
    readyTemplatesDescription:
      'Підійдуть для кафе, ресторанів, барів чи кондитерських. Легко налаштовуються, швидко запускаються та допомагають виглядати професійно онлайн без зайвих витрат часу.',
    platformText: 'Меню ресторану',
    platformPizzaText: 'Маргарита',
    platformReceiptText: 'Томати, сир, салямі, кукурудза',
    platformMealText: 'Яєчня з беконом',
    platformMealReceiptText: 'Яйця, бекон, салат, помідор',
    clickMe: 'Натисни мене • Натисни мене • Натисни мене • Натисни мене •',
    classicMenu: 'Класичне меню',
    menu: [
      {
        name: 'Салат Цезар',
        ingredients: 'Курка, салат, сухарики, пармезан, соус',
      },
      {
        name: 'Борщ український',
        ingredients: 'Буряк, картопля, морква, капуста, м’ясо',
      },
      {
        name: 'Паста Карбонара',
        ingredients: 'Паста, бекон, яйце, пармезан, вершки',
      },
      {
        name: 'Олів’є',
        ingredients: 'Картопля, морква, горошок, ковбаса, майонез',
      },
    ],
  },
  button: {
    clickMe: 'Натисни мене',
  },
}
